{
    "added_tokens_decoder": {
      "163584": {
        "content": "[BOS]",
        "lstrip": false,
        "normalized": false,
        "rstrip": false,
        "single_word": false,
        "special": true
      },
      "163585": {
        "content": "[EOS]",
        "lstrip": false,
        "normalized": false,
        "rstrip": false,
        "single_word": false,
        "special": true
      },
      "163586": {
        "content": "<|im_end|>",
        "lstrip": false,
        "normalized": false,
        "rstrip": false,
        "single_word": false,
        "special": true
      },
      "163587": {
        "content": "<|im_user|>",
        "lstrip": false,
        "normalized": false,
        "rstrip": false,
        "single_word": false,
        "special": true
      },
      "163588": {
        "content": "<|im_assistant|>",
        "lstrip": false,
        "normalized": false,
        "rstrip": false,
        "single_word": false,
        "special": true
      },
      "163590": {
        "content": "<|start_header_id|>",
        "lstrip": false,
        "normalized": false,
        "rstrip": false,
        "single_word": false,
        "special": true
      },
      "163591": {
        "content": "<|end_header_id|>",
        "lstrip": false,
        "normalized": false,
        "rstrip": false,
        "single_word": false,
        "special": true
      },
      "163593": {
        "content": "[EOT]",
        "lstrip": false,
        "normalized": false,
        "rstrip": false,
        "single_word": false,
        "special": true
      },
      "163594": {
        "content": "<|im_system|>",
        "lstrip": false,
        "normalized": false,
        "rstrip": false,
        "single_word": false,
        "special": true
      },
      "163601": {
        "content": "<|im_middle|>",
        "lstrip": false,
        "normalized": false,
        "rstrip": false,
        "single_word": false,
        "special": true
      },
      "163838": {
        "content": "[UNK]",
        "lstrip": false,
        "normalized": false,
        "rstrip": false,
        "single_word": false,
        "special": true
      },
      "163839": {
        "content": "[PAD]",
        "lstrip": false,
        "normalized": false,
        "rstrip": false,
        "single_word": false,
        "special": true
      }
    },
    "additional_special_tokens": [
      "<|im_end|>",
      "<|im_user|>",
      "<|im_assistant|>",
      "<|start_header_id|>",
      "<|end_header_id|>",
      "[EOT]",
      "<|im_system|>",
      "<|im_middle|>"
    ],
    "auto_map": {
      "AutoTokenizer": [
        "tokenization_kimi.TikTokenTokenizer",
        null
      ]
    },
    "bos_token": "[BOS]",
    "clean_up_tokenization_spaces": false,
    "eos_token": "[EOS]",
    "extra_special_tokens": {},
    "model_max_length": 131072,
    "pad_token": "[PAD]",
    "padding_side": "left",
    "tokenizer_class": "TikTokenTokenizer",
    "unk_token": "[UNK]",
    "chat_template": "{% if tools -%}\n    {{ '<|im_system|>tool_declare<|im_middle|>' -}}\n    {{- tools | tojson -}}\n    {{ '<|im_end|>' -}}\n{%- endif -%}\n\n{%- for message in messages -%}\n  {%- if loop.first and messages[0]['role'] != 'system' -%}\n    {{ '<|im_system|>system<|im_middle|>You are a helpful assistant<|im_end|>' }}\n  {%- endif -%}\n  {%- if message['role'] == 'system' -%}\n    {{ '<|im_system|>system<|im_middle|>' }}\n  {%- elif message['role'] == 'user' -%}\n    {{ '<|im_user|>user<|im_middle|>' }}\n  {%- elif message['role'] == 'assistant' -%}\n    {{ '<|im_assistant|>assistant<|im_middle|>' }}\n  {%- elif message['role'] == 'tool' -%}\n    {{ '<|im_system|>tool<|im_middle|>' }}\n  {%- endif -%}\n\n  {%- if message['content'] is string -%}\n    {{- message['content'] + '<|im_end|>' -}}\n  {%- else -%}\n    {%- for content in message['content'] -%}\n      {%- if content['type'] == 'image' or 'image' in content or 'image_url' in content -%}\n        {{ '<|media_start|>image<|media_content|><|media_pad|><|media_end|>' }}\n      {%- else -%}\n        {{ content['text'] }}\n      {%- endif -%}\n    {%- endfor -%}\n    {{ '<|im_end|>' }}\n  {%- endif -%}\n{%- endfor -%}\n\n{%- if add_generation_prompt -%}\n  {{ '<|im_assistant|>assistant<|im_middle|>' }}\n{%- endif -%}"
  }
  